Netology1/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <predefined>
    <items>
      <name>EMailКонтрагента</name>
      <description>E mail контрагента</description>
    </items>
    <items>
      <name>ПочтовыйАдресКонтрагента</name>
      <description>Почтовый адрес контрагент</description>
    </items>
    <items>
      <name>ТелефонКонтрагента</name>
      <description>Телефон контрагента</description>
    </items>
    <items>
      <name>ФактическийАдресКонтрагента</name>
      <description>Фактический адрес контраг</description>
    </items>
    <items>
      <name>ЮридическийАдресКонтрагента</name>
      <description>Юридический адрес контраг</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
</mdclass:Catalog>

Netology1/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>EMail</name>
  </enumValues>
  <enumValues>
    <name>Вебсайт</name>
  </enumValues>
</mdclass:Enum>

Netology1/src/Catalogs/ВидыКонтактнойИнформации/ManagerModule.bsl
Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт

ТипАдрес = Перечисления.ТипыКонтактнойИнформации.Адрес; 

ПредопределенныйОбъект = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента.ПолучитьОбъект();
ПредопределенныйОбъект.Тип = ТипАдрес;
ПредопределенныйОбъект.Записать();

ПредопределенныйОбъект = ПочтовыйАдресКонтрагента.ПолучитьОбъект();
ПредопределенныйОбъект.Тип = ТипАдрес;
ПредопределенныйОбъект.Записать();

ПредопределенныйОбъект = ФактическийАдресКонтрагента.ПолучитьОбъект();
ПредопределенныйОбъект.Тип = ТипАдрес;
ПредопределенныйОбъект.Записать();

ПредопределенныйОбъект = ТелефонКонтрагента.ПолучитьОбъект();
ПредопределенныйОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
ПредопределенныйОбъект.Записать();

ПредопределенныйОбъект = EMailКонтрагента.ПолучитьОбъект();
ПредопределенныйОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.EMail;
ПредопределенныйОбъект.Записать();

КонецПроцедуры
